{smcl}
{com}{sf}{ul off}{txt}{.-}
      name:  {res}<unnamed>
       {txt}log:  {res}/Users/aml/AutoEmp/logs/demographics_prep.txt
  {txt}log type:  {res}smcl
 {txt}opened on:  {res}31 Jul 2024, 14:09:57
{txt}
{com}. 
. ***
. *** 1) Prepare population data for year 2016 (sheet 27)
. ***
. 
. import excel "raw_data/eurostat/demographics_gender.xlsx", sheet("Sheet 27") ///
>         cellrange(B12:E115) firstrow    
{res}{text}(4 vars, 103 obs)

{com}. 
. tempfile population_2016
{txt}
{com}.         
. drop if missing(population) | missing(males) | missing(females)
{txt}(1 observation deleted)

{com}. gen population_2016 = population / 1000
{txt}
{com}. drop males females population
{txt}
{com}. drop if _n == 1
{txt}(1 observation deleted)

{com}. 
. save `population_2016'
{txt}{p 0 4 2}
file {bf}
/var/folders/gj/lpt24fdn4bz32zqcdsrmyzz80000gn/T//S_94849.000001{rm}
saved
as .dta format
{p_end}

{com}. clear
{txt}
{com}. 
. ***
. *** 2) Prepare working-age population data for year 2000 (sheet 11)
. ***
. 
. import excel "raw_data/eurostat/demographics_age.xlsx", sheet("Sheet 11") ///
>         cellrange(B12:D115) firstrow    
{res}{text}(3 vars, 103 obs)

{com}. 
. tempfile working_age_pop
{txt}
{com}.         
. drop if missing(working_age_pop)
{txt}(3 observations deleted)

{com}. replace working_age_pop = working_age_pop / 1000
{txt}variable {bf}{res}working_age_pop{sf}{txt} was {bf}{res}long{sf}{txt} now {bf}{res}double{sf}
{txt}(100 real changes made)

{com}. drop population
{txt}
{com}. drop if _n == 1
{txt}(1 observation deleted)

{com}. 
. save `working_age_pop'
{txt}{p 0 4 2}
file {bf}
/var/folders/gj/lpt24fdn4bz32zqcdsrmyzz80000gn/T//S_94849.000002{rm}
saved
as .dta format
{p_end}

{com}. clear
{txt}
{com}. 
. ***
. *** 3) Prepare population data for year 2000 (sheet 11)
. ***
. 
. import excel "raw_data/eurostat/demographics_gender.xlsx", sheet("Sheet 11") ///
>         cellrange(B12:E115) firstrow    
{res}{text}(4 vars, 103 obs)

{com}.         
. drop if missing(population) | missing(males) | missing(females)
{txt}(3 observations deleted)

{com}. gen female_share = females / population
{txt}
{com}. gen population_2000 = population / 1000
{txt}
{com}. drop males females population
{txt}
{com}. drop if _n == 1
{txt}(1 observation deleted)

{com}. 
. ***
. *** 4) Merge data into one data set
. ***
. 
. merge 1:1 region using `population_2016', keepusing(population_2016)
{res}
{txt}{col 5}Result{col 33}Number of obs
{col 5}{hline 41}
{col 5}Not matched{col 30}{res}               2
{txt}{col 9}from master{col 30}{res}               0{txt}  (_merge==1)
{col 9}from using{col 30}{res}               2{txt}  (_merge==2)

{col 5}Matched{col 30}{res}              99{txt}  (_merge==3)
{col 5}{hline 41}

{com}. drop if _merge == 2
{txt}(2 observations deleted)

{com}. drop _merge
{txt}
{com}. 
. merge 1:1 region using `working_age_pop', keepusing(working_age_pop)
{res}
{txt}{col 5}Result{col 33}Number of obs
{col 5}{hline 41}
{col 5}Not matched{col 30}{res}               0
{txt}{col 5}Matched{col 30}{res}              99{txt}  (_merge==3)
{col 5}{hline 41}

{com}. drop if _merge == 2
{txt}(0 observations deleted)

{com}. drop _merge
{txt}
{com}. 
. save "clean_data/demographics.dta", replace
{txt}{p 0 4 2}
file {bf}
clean_data/demographics.dta{rm}
saved
{p_end}

{com}. cd "/Users/aml/AutoEmp/do_files"
{res}/Users/aml/AutoEmp/do_files
{txt}
{com}. log close
      {txt}name:  {res}<unnamed>
       {txt}log:  {res}/Users/aml/AutoEmp/logs/demographics_prep.txt
  {txt}log type:  {res}smcl
 {txt}closed on:  {res}31 Jul 2024, 14:09:57
{txt}{.-}
{smcl}
{txt}{sf}{ul off}