{smcl}
{com}{sf}{ul off}{txt}{.-}
      name:  {res}<unnamed>
       {txt}log:  {res}/Users/aml/AutoEmp/logs/demographics_prep.txt
  {txt}log type:  {res}smcl
 {txt}opened on:  {res} 4 Aug 2024, 16:35:24
{txt}
{com}. 
. ***
. *** 1) Prepare population data for year 2016 (sheet 18)
. ***
. 
. import excel "raw_data/eurostat/nuts2_demographics_gender.xlsx", sheet("Sheet 18") ///
>         cellrange(A13:D36) firstrow     
{res}{text}(4 vars, 23 obs)

{com}. 
. tempfile population_2016
{txt}
{com}.         
. drop if missing(population)
{txt}(0 observations deleted)

{com}. rename population population_2016
{res}{txt}
{com}. drop if _n == 1
{txt}(1 observation deleted)

{com}. drop females
{txt}
{com}. 
. save `population_2016'
{txt}{p 0 4 2}
file {bf}
/var/folders/gj/lpt24fdn4bz32zqcdsrmyzz80000gn/T//S_94849.000001{rm}
saved
as .dta format
{p_end}

{com}. clear
{txt}
{com}. 
. ***
. *** 2) Prepare working-age population data for year 2001
. ***
. 
. import excel "raw_data/eurostat/nuts2_demographics_working_age.xlsx", sheet("Sheet 1") ///
>         cellrange(A12:AA35) firstrow    
{res}{text}(27 vars, 23 obs)

{com}. 
. tempfile working_age_pop
{txt}
{com}.         
. keep region_code region working_age_pop_2001
{txt}
{com}. rename working_age_pop_2001 working_age_pop
{res}{txt}
{com}. drop if missing(working_age_pop)
{txt}(0 observations deleted)

{com}. drop if _n == 1
{txt}(1 observation deleted)

{com}. 
. save `working_age_pop'
{txt}{p 0 4 2}
file {bf}
/var/folders/gj/lpt24fdn4bz32zqcdsrmyzz80000gn/T//S_94849.000002{rm}
saved
as .dta format
{p_end}

{com}. clear
{txt}
{com}. 
. ***
. *** 3) Prepare education data for year 2001 (sheet 3)
. ***
. 
. import excel "raw_data/eurostat/demographics_educ.xlsx", sheet("Sheet 3") ///
>         cellrange(A13:E36) firstrow     
{res}{err}worksheet {bf:Sheet 3} not found
{res}{txt}{search r(601), local:r(601);}

end of do-file

{search r(601), local:r(601);}

{com}. cd do_files/nuts2_data_prep
{res}/Users/aml/AutoEmp/do_files/nuts2_data_prep

{com}. do demographics_prep
{txt}
{com}. clear
{txt}
{com}. capture log c
{smcl}
{com}{sf}{ul off}