{smcl}
{com}{sf}{ul off}{txt}{.-}
      name:  {res}<unnamed>
       {txt}log:  {res}/Users/aml/AutoEmp/logs/emp_countries_prep.txt
  {txt}log type:  {res}smcl
 {txt}opened on:  {res} 1 Aug 2024, 12:17:56
{txt}
{com}. 
. // Data for year 2000 (sheet 9)
. import excel "raw_data/eurostat/emp_countries.xlsx", sheet("Sheet 9") ///
>         cellrange(A12:F21) firstrow
{res}{text}(6 vars, 9 obs)

{com}. 
. keep country agri_forest_fish industry manufact construct
{txt}
{com}. gen other_industry = industry - manufact - construct
{txt}(1 missing value generated)

{com}. drop industry
{txt}
{com}. 
. // Aggregate on country level
. foreach v in agri_forest_fish manufact construct other_industry {c -(}
{txt}  2{com}.         egen emp_base_`v' = total(`v')
{txt}  3{com}.         drop `v'
{txt}  4{com}. {c )-}
{txt}
{com}. 
. drop country
{txt}
{com}. duplicates drop

{p 0 4}{txt}Duplicates in terms of {txt} all variables{p_end}

(8 observations deleted)

{com}. 
. // Add id variable for merge later
. gen id = _n
{txt}
{com}. 
. save "clean_data/emp_countries.dta", replace
{txt}{p 0 4 2}
file {bf}
clean_data/emp_countries.dta{rm}
saved
{p_end}

{com}. cd "/Users/aml/AutoEmp/do_files"
{res}/Users/aml/AutoEmp/do_files
{txt}
{com}. 
. log close
      {txt}name:  {res}<unnamed>
       {txt}log:  {res}/Users/aml/AutoEmp/logs/emp_countries_prep.txt
  {txt}log type:  {res}smcl
 {txt}closed on:  {res} 1 Aug 2024, 12:17:56
{txt}{.-}
{smcl}
{txt}{sf}{ul off}