{smcl}
{com}{sf}{ul off}{txt}{.-}
      name:  {res}<unnamed>
       {txt}log:  {res}/Users/aml/AutoEmp/logs/emp_regions_prep.txt
  {txt}log type:  {res}smcl
 {txt}opened on:  {res} 2 Aug 2024, 17:38:53
{txt}
{com}. 
. ***
. *** 1) Employment data for import exposure in year 2012 (sheet 18)
. ***
. 
. // i) National employment (employment base)
. import excel "raw_data/eurostat/emp_regions.xlsx", sheet("Sheet 18") ///
>         cellrange(A12:G114) firstrow
{res}{text}(7 vars, 102 obs)

{com}. 
. tempfile emp_France_2012
{txt}
{com}. 
. destring total_emp_2012, replace
{txt}total_emp_2012 already numeric; no {res}replace
{txt}
{com}. gen other_industry = industry_ex_construct - manufact
{txt}(1 missing value generated)

{com}. drop industry_ex_construct
{txt}
{com}. keep if _n == 1
{txt}(101 observations deleted)

{com}. gen id = 1
{txt}
{com}. 
. foreach v in agri_forest_fish manufact construct other_industry {c -(}
{txt}  2{com}.         rename `v' imp_emp_base_`v'
{txt}  3{com}. {c )-}
{res}{txt}
{com}. 
. save `emp_France_2012'
{txt}{p 0 4 2}
file {bf}
/var/folders/gj/lpt24fdn4bz32zqcdsrmyzz80000gn/T//S_94849.000001{rm}
saved
as .dta format
{p_end}

{com}. clear
{txt}
{com}. 
. // ii) Regional employment (employment shares)
. import excel "raw_data/eurostat/emp_regions.xlsx", sheet("Sheet 18") ///
>         cellrange(A12:G114) firstrow
{res}{text}(7 vars, 102 obs)

{com}.         
. tempfile emp_regions_2012
{txt}
{com}. 
. drop if missing(total_emp_2012) | missing(agri_forest_fish) | ///
>         missing(industry_ex_construct) | missing(manufact) | missing(construct)
{txt}(1 observation deleted)

{com}. 
. destring total_emp_2012, replace
{txt}total_emp_2012 already numeric; no {res}replace
{txt}
{com}. gen other_industry = industry_ex_construct - manufact
{txt}
{com}. drop industry_ex_construct
{txt}
{com}. drop if _n == 1
{txt}(1 observation deleted)

{com}. 
. foreach v in agri_forest_fish manufact construct other_industry {c -(}
{txt}  2{com}.         gen imp_emp_share_`v' = `v' / total_emp_2012
{txt}  3{com}.         drop `v'
{txt}  4{com}. {c )-}
{txt}
{com}. 
. save `emp_regions_2012'
{txt}{p 0 4 2}
file {bf}
/var/folders/gj/lpt24fdn4bz32zqcdsrmyzz80000gn/T//S_94849.000002{rm}
saved
as .dta format
{p_end}

{com}. clear
{txt}
{com}. 
. ***
. *** 2) Regional employment data for outcome in year 2016 (sheet 22)
. ***
. 
. import excel "raw_data/eurostat/emp_regions.xlsx", sheet("Sheet 22") ///
>         cellrange(A12:G114) firstrow    
{res}{text}(7 vars, 102 obs)

{com}. 
. tempfile emp_regions_2016
{txt}
{com}. drop if _n == 1 // Drop France as an observation
{txt}(1 observation deleted)

{com}. destring total_emp_2016, replace        
{txt}total_emp_2016 already numeric; no {res}replace
{txt}
{com}. save `emp_regions_2016'
{txt}{p 0 4 2}
file {bf}
/var/folders/gj/lpt24fdn4bz32zqcdsrmyzz80000gn/T//S_94849.000003{rm}
saved
as .dta format
{p_end}

{com}. clear
{txt}
{com}. 
. ***
. *** 3) Regional employment data for outcome and robot exposure in year 2000 (sheet 6)
. ***
. 
. import excel "raw_data/eurostat/emp_regions.xlsx", sheet("Sheet 6") ///
>         cellrange(A12:G114) firstrow
{res}{text}(7 vars, 102 obs)

{com}. 
. drop if missing(total_emp_2000) | missing(agri_forest_fish) | ///
>         missing(industry_ex_construct) | missing(manufact) | missing(construct)
{txt}(1 observation deleted)

{com}. 
. destring total_emp_2000, replace
{txt}total_emp_2000 already numeric; no {res}replace
{txt}
{com}. gen other_industry = industry_ex_construct - manufact
{txt}
{com}. drop industry_ex_construct
{txt}
{com}. drop if _n == 1
{txt}(1 observation deleted)

{com}.         
. foreach v in agri_forest_fish manufact construct other_industry {c -(}
{txt}  2{com}.         
.         // i) Employment shares
.         gen emp_share_`v' = `v' / total_emp_2000
{txt}  3{com}.         drop `v'
{txt}  4{com}.         
.         // ii) Variables for merge later
.         gen emp_base_`v' = .
{txt}  5{com}.         gen diff_robots_`v' = .
{txt}  6{com}. {c )-}
{txt}(100 missing values generated)
(100 missing values generated)
(100 missing values generated)
(100 missing values generated)
(100 missing values generated)
(100 missing values generated)
(100 missing values generated)
(100 missing values generated)

{com}. 
. ***
. *** 4) Merge into one data set
. ***
. 
. // Add id variable for merge
. gen id = 1
{txt}
{com}. 
. merge 1:1 region_code using `emp_regions_2016', keepusing(total_emp_2016)
{res}
{txt}{col 5}Result{col 33}Number of obs
{col 5}{hline 41}
{col 5}Not matched{col 30}{res}               1
{txt}{col 9}from master{col 30}{res}               0{txt}  (_merge==1)
{col 9}from using{col 30}{res}               1{txt}  (_merge==2)

{col 5}Matched{col 30}{res}             100{txt}  (_merge==3)
{col 5}{hline 41}

{com}. drop if _merge == 2
{txt}(1 observation deleted)

{com}. drop _merge
{txt}
{com}. 
. merge 1:1 region_code using `emp_regions_2012', keepusing( ///
>         imp_emp_share_agri_forest_fish imp_emp_share_manufact ///
>         imp_emp_share_construct imp_emp_share_other_industry)
{res}
{txt}{col 5}Result{col 33}Number of obs
{col 5}{hline 41}
{col 5}Not matched{col 30}{res}               0
{txt}{col 5}Matched{col 30}{res}             100{txt}  (_merge==3)
{col 5}{hline 41}

{com}. drop if _merge == 2
{txt}(0 observations deleted)

{com}. drop _merge
{txt}
{com}. 
. merge m:1 id using `emp_France_2012', keepusing(imp_emp_base_agri_forest_fish ///
>         imp_emp_base_manufact imp_emp_base_construct imp_emp_base_other_industry id)
{res}
{txt}{col 5}Result{col 33}Number of obs
{col 5}{hline 41}
{col 5}Not matched{col 30}{res}               0
{txt}{col 5}Matched{col 30}{res}             100{txt}  (_merge==3)
{col 5}{hline 41}

{com}. drop _merge
{txt}
{com}. 
. save "clean_data/emp_regions.dta", replace
{txt}{p 0 4 2}
file {bf}
clean_data/emp_regions.dta{rm}
saved
{p_end}

{com}. cd "/Users/aml/AutoEmp/do_files"
{res}/Users/aml/AutoEmp/do_files
{txt}
{com}. log close
      {txt}name:  {res}<unnamed>
       {txt}log:  {res}/Users/aml/AutoEmp/logs/emp_regions_prep.txt
  {txt}log type:  {res}smcl
 {txt}closed on:  {res} 2 Aug 2024, 17:38:53
{txt}{.-}
{smcl}
{txt}{sf}{ul off}