{smcl}
{com}{sf}{ul off}{txt}{.-}
      name:  {res}<unnamed>
       {txt}log:  {res}/Users/aml/AutoEmp/logs/estimation.txt
  {txt}log type:  {res}smcl
 {txt}opened on:  {res} 4 Aug 2024, 18:01:54
{txt}
{com}. 
. use "clean_data/nuts2_reg_ready.dta"
{txt}
{com}. 
. // First stage
. regress robot_exposure frobot_exposure, noconstant

{txt}      Source {c |}       SS           df       MS      Number of obs   ={res}        21
{txt}{hline 13}{c +}{hline 34}   F(1, 20)        = {res}   644.50
{txt}       Model {c |} {res} 42.4227133         1  42.4227133   {txt}Prob > F        ={res}    0.0000
{txt}    Residual {c |} {res} 1.31645127        20  .065822564   {txt}R-squared       ={res}    0.9699
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.9684
{txt}       Total {c |} {res} 43.7391646        21  2.08281736   {txt}Root MSE        =   {res} .25656

{txt}{hline 16}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1} robot_exposure{col 17}{c |} Coefficient{col 29}  Std. err.{col 41}      t{col 49}   P>|t|{col 57}     [95% con{col 70}f. interval]
{hline 16}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
frobot_exposure {c |}{col 17}{res}{space 2} 3.375131{col 29}{space 2} .1329471{col 40}{space 1}   25.39{col 49}{space 3}0.000{col 57}{space 4} 3.097808{col 70}{space 3} 3.652454
{txt}{hline 16}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. twoway (scatter robot_exposure frobot_exposure) ///
>         (lfit robot_exposure frobot_exposure)
{res}{txt}
{com}. 
. // Reduced form regressions
. regress diff_emp_to_pop robot_exposure import_exposure female_share ///
>         population_2001 bachelor_share high_school_share ///
>         [w=working_age_pop], noconstant 
{txt}(analytic weights assumed)
(sum of wgt is 37,517.3)

      Source {c |}       SS           df       MS      Number of obs   ={res}        21
{txt}{hline 13}{c +}{hline 34}   F(6, 15)        = {res}     3.58
{txt}       Model {c |} {res} .009540859         6  .001590143   {txt}Prob > F        ={res}    0.0209
{txt}    Residual {c |} {res} .006659393        15   .00044396   {txt}R-squared       ={res}    0.5889
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.4245
{txt}       Total {c |} {res} .016200251        21  .000771441   {txt}Root MSE        =   {res} .02107

{txt}{hline 18}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}  diff_emp_to_pop{col 19}{c |} Coefficient{col 31}  Std. err.{col 43}      t{col 51}   P>|t|{col 59}     [95% con{col 72}f. interval]
{hline 18}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 3}robot_exposure {c |}{col 19}{res}{space 2}-.0133257{col 31}{space 2} .0085962{col 42}{space 1}   -1.55{col 51}{space 3}0.142{col 59}{space 4}-.0316482{col 72}{space 3} .0049967
{txt}{space 2}import_exposure {c |}{col 19}{res}{space 2}-3.44e-06{col 31}{space 2} 5.20e-06{col 42}{space 1}   -0.66{col 51}{space 3}0.518{col 59}{space 4}-.0000145{col 72}{space 3} 7.64e-06
{txt}{space 5}female_share {c |}{col 19}{res}{space 2}  .129081{col 31}{space 2}  .159708{col 42}{space 1}    0.81{col 51}{space 3}0.432{col 59}{space 4}-.2113286{col 72}{space 3} .4694905
{txt}{space 2}population_2001 {c |}{col 19}{res}{space 2}-6.32e-06{col 31}{space 2} 7.47e-06{col 42}{space 1}   -0.85{col 51}{space 3}0.411{col 59}{space 4}-.0000222{col 72}{space 3} 9.60e-06
{txt}{space 3}bachelor_share {c |}{col 19}{res}{space 2} .0731862{col 31}{space 2} .2599756{col 42}{space 1}    0.28{col 51}{space 3}0.782{col 59}{space 4}-.4809387{col 72}{space 3} .6273111
{txt}high_school_share {c |}{col 19}{res}{space 2}-.0767722{col 31}{space 2} .2070668{col 42}{space 1}   -0.37{col 51}{space 3}0.716{col 59}{space 4}-.5181246{col 72}{space 3} .3645802
{txt}{hline 18}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}.         
. // 2 stage least squares estimation
. ivregress 2sls diff_emp_to_pop (frobot_exposure = robot_exposure) ///
>         import_exposure female_share population_2001 bachelor_share ///
>         high_school_share [w=working_age_pop], noconstant 
{res}{txt}(analytic weights assumed)
(sum of wgt is   3.7517e+04)
{res}
{txt}{col 1}Instrumental variables 2SLS regression{col 51}Number of obs{col 67}= {res}        21
{txt}{col 1}{col 51}Wald chi2({res}6{txt}){col 67}= {res}         .
{txt}{col 1}{col 51}Prob > chi2{col 67}= {res}         .
{txt}{col 1}{col 51}R-squared{col 67}= {res}         .
{txt}{col 51}Root MSE{col 67}=    {res} .01871

{txt}{hline 18}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}  diff_emp_to_pop{col 19}{c |} Coefficient{col 31}  Std. err.{col 43}      z{col 51}   P>|z|{col 59}     [95% con{col 72}f. interval]
{hline 18}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 2}frobot_exposure {c |}{col 19}{res}{space 2}-.0508672{col 31}{space 2} .0291391{col 42}{space 1}   -1.75{col 51}{space 3}0.081{col 59}{space 4}-.1079787{col 72}{space 3} .0062443
{txt}{space 2}import_exposure {c |}{col 19}{res}{space 2}-5.49e-06{col 31}{space 2} 4.49e-06{col 42}{space 1}   -1.22{col 51}{space 3}0.222{col 59}{space 4}-.0000143{col 72}{space 3} 3.32e-06
{txt}{space 5}female_share {c |}{col 19}{res}{space 2} .1149614{col 31}{space 2} .1411539{col 42}{space 1}    0.81{col 51}{space 3}0.415{col 59}{space 4}-.1616952{col 72}{space 3}  .391618
{txt}{space 2}population_2001 {c |}{col 19}{res}{space 2}-6.56e-06{col 31}{space 2} 6.69e-06{col 42}{space 1}   -0.98{col 51}{space 3}0.327{col 59}{space 4}-.0000197{col 72}{space 3} 6.56e-06
{txt}{space 3}bachelor_share {c |}{col 19}{res}{space 2}   .07887{col 31}{space 2} .2320631{col 42}{space 1}    0.34{col 51}{space 3}0.734{col 59}{space 4}-.3759653{col 72}{space 3} .5337054
{txt}high_school_share {c |}{col 19}{res}{space 2}-.0565426{col 31}{space 2} .1827038{col 42}{space 1}   -0.31{col 51}{space 3}0.757{col 59}{space 4}-.4146355{col 72}{space 3} .3015502
{txt}{hline 18}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{p 0 12 20}Endogenous: {res:frobot_exposure}{p_end}
{p 0 12 20}Exogenous:{space 1} {res:import_exposure female_share population_2001 bachelor_share high_school_share robot_exposure}{p_end}

{com}. 
. cd "/Users/aml/AutoEmp/do_files"
{res}/Users/aml/AutoEmp/do_files
{txt}
{com}. log close
      {txt}name:  {res}<unnamed>
       {txt}log:  {res}/Users/aml/AutoEmp/logs/estimation.txt
  {txt}log type:  {res}smcl
 {txt}closed on:  {res} 4 Aug 2024, 18:01:54
{txt}{.-}
{smcl}
{txt}{sf}{ul off}