{smcl}
{com}{sf}{ul off}{txt}{.-}
      name:  {res}<unnamed>
       {txt}log:  {res}/Users/aml/AutoEmp/logs/first_stage.txt
  {txt}log type:  {res}smcl
 {txt}opened on:  {res} 2 Aug 2024, 17:24:34
{txt}
{com}. 
. foreach v in fr_emp_base emp_base {c -(}
{txt}  2{com}.         
.         use "clean_data/emp_countries.dta"
{txt}  3{com}.         keep `v'_*
{txt}  4{com}. 
.         tempfile tem_`v'
{txt}  5{com}.         xpose, clear
{txt}  6{com}.         gen id = _n
{txt}  7{com}.         rename v1 `v'
{txt}  8{com}.         save `tem_`v''
{txt}  9{com}.         clear
{txt} 10{com}. {c )-}
{res}{txt}{p 0 4 2}
file {bf}
/var/folders/gj/lpt24fdn4bz32zqcdsrmyzz80000gn/T//S_94849.000001{rm}
saved
as .dta format
{p_end}
{res}{txt}{p 0 4 2}
file {bf}
/var/folders/gj/lpt24fdn4bz32zqcdsrmyzz80000gn/T//S_94849.000002{rm}
saved
as .dta format
{p_end}

{com}. 
. foreach v in fr_diff_robots diff_robots {c -(}
{txt}  2{com}.         
.         use "clean_data/diff_robots.dta"
{txt}  3{com}.         keep `v'_*
{txt}  4{com}. 
.         tempfile tem_`v'
{txt}  5{com}.         xpose, clear
{txt}  6{com}.         gen id = _n
{txt}  7{com}.         rename v1 `v'
{txt}  8{com}.         save `tem_`v''
{txt}  9{com}.         clear
{txt} 10{com}. {c )-}
{res}{txt}{p 0 4 2}
file {bf}
/var/folders/gj/lpt24fdn4bz32zqcdsrmyzz80000gn/T//S_94849.000003{rm}
saved
as .dta format
{p_end}
{res}{txt}{p 0 4 2}
file {bf}
/var/folders/gj/lpt24fdn4bz32zqcdsrmyzz80000gn/T//S_94849.000004{rm}
saved
as .dta format
{p_end}

{com}. 
. use `tem_fr_emp_base'
{txt}
{com}. 
. merge 1:1 id using `tem_emp_base'
{res}
{txt}{col 5}Result{col 33}Number of obs
{col 5}{hline 41}
{col 5}Not matched{col 30}{res}               0
{txt}{col 5}Matched{col 30}{res}               4{txt}  (_merge==3)
{col 5}{hline 41}

{com}. drop _merge
{txt}
{com}. 
. merge 1:1 id using `tem_fr_diff_robots'
{res}
{txt}{col 5}Result{col 33}Number of obs
{col 5}{hline 41}
{col 5}Not matched{col 30}{res}               0
{txt}{col 5}Matched{col 30}{res}               4{txt}  (_merge==3)
{col 5}{hline 41}

{com}. drop _merge
{txt}
{com}. 
. merge 1:1 id using `tem_diff_robots'
{res}
{txt}{col 5}Result{col 33}Number of obs
{col 5}{hline 41}
{col 5}Not matched{col 30}{res}               0
{txt}{col 5}Matched{col 30}{res}               4{txt}  (_merge==3)
{col 5}{hline 41}

{com}. drop _merge id
{txt}
{com}. 
. gen diff_robots_to_pop = diff_robots / emp_base
{txt}
{com}. gen diff_fr_robots_to_pop = fr_diff_robots / fr_emp_base 
{txt}
{com}. 
. regress diff_fr_robots_to_pop diff_robots_to_pop

{txt}      Source {c |}       SS           df       MS      Number of obs   ={res}         4
{txt}{hline 13}{c +}{hline 34}   F(1, 2)         = {res}    67.59
{txt}       Model {c |} {res}   17.98717         1    17.98717   {txt}Prob > F        ={res}    0.0145
{txt}    Residual {c |} {res} .532275908         2  .266137954   {txt}R-squared       ={res}    0.9713
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.9569
{txt}       Total {c |} {res} 18.5194459         3  6.17314863   {txt}Root MSE        =   {res} .51589

{txt}{hline 19}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}diff_fr_robots_t~p{col 20}{c |} Coefficient{col 32}  Std. err.{col 44}      t{col 52}   P>|t|{col 60}     [95% con{col 73}f. interval]
{hline 19}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
diff_robots_to_pop {c |}{col 20}{res}{space 2} .3898019{col 32}{space 2}  .047415{col 43}{space 1}    8.22{col 52}{space 3}0.014{col 60}{space 4} .1857915{col 73}{space 3} .5938122
{txt}{space 13}_cons {c |}{col 20}{res}{space 2} .3094625{col 32}{space 2} .3010951{col 43}{space 1}    1.03{col 52}{space 3}0.412{col 60}{space 4} -.986045{col 73}{space 3}  1.60497
{txt}{hline 19}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. twoway (scatter diff_fr_robots_to_pop diff_robots_to_pop) ///
>         (lfit diff_fr_robots_to_pop diff_robots_to_pop)
{res}{txt}
{com}. 
. save "clean_data/first_stage.dta", replace
{txt}{p 0 4 2}
file {bf}
clean_data/first_stage.dta{rm}
saved
{p_end}

{com}. cd "/Users/aml/AutoEmp/do_files"
{res}/Users/aml/AutoEmp/do_files
{txt}
{com}. log close
      {txt}name:  {res}<unnamed>
       {txt}log:  {res}/Users/aml/AutoEmp/logs/first_stage.txt
  {txt}log type:  {res}smcl
 {txt}closed on:  {res} 2 Aug 2024, 17:24:34
{txt}{.-}
{smcl}
{txt}{sf}{ul off}