{smcl}
{com}{sf}{ul off}{txt}{.-}
      name:  {res}<unnamed>
       {txt}log:  {res}/Users/aml/AutoEmp/logs/ifr_prep.txt
  {txt}log type:  {res}smcl
 {txt}opened on:  {res}18 Jul 2024, 23:15:13
{txt}
{com}. 
. import excel "raw_data/ifr/IFR_data_new.xlsx", sheet("Sheet1") firstrow
{res}{text}(7 vars, 1,296 obs)

{com}. save "raw_data/ifr/IFR_data_new.dta", replace
{txt}{p 0 4 2}
file {bf}
raw_data/ifr/IFR_data_new.dta{rm}
saved
{p_end}

{com}. 
. // 1) Remove unnecessary observations
. keep if Year == 1999 | Year == 2008
{txt}(1,188 observations deleted)

{com}. drop if industrycode == "P"
{txt}(18 observations deleted)

{com}. drop if country == "France"
{txt}(10 observations deleted)

{com}. 
. // 2) Aggregagte on country level
. sort industrycode Year
{txt}
{com}. by industrycode Year: egen robot_stock = total(op_stock) 
{txt}
{com}. drop delivered op_stock country countrycode
{txt}
{com}. duplicates drop Year industrycode, force

{p 0 4}{txt}Duplicates in terms of {res} Year industrycode{p_end}

{txt}(70 observations deleted)

{com}. 
. // 3) Aggregate on industry level
. replace industrycode = "CE" if ///
>         industrycode == "C" | industrycode == "D" | industrycode == "E"
{txt}(6 real changes made)

{com}.         
. collapse (sum) robot_stock, by(Year industrycode)
{res}{txt}
{com}. 
. // 4) Compute long differences and transpose
. by industrycode (Year), sort: ///
>         gen diff_robot_stock = robot_stock - robot_stock[_n-1]
{txt}(3 missing values generated)

{com}. 
. drop if Year == 1999
{txt}(3 observations deleted)

{com}. drop Year robot_stock
{txt}
{com}. sxpose, clear force firstnames destring
{txt}AB: all characters numeric; {res}replaced {txt}as {res}int
{txt}CE: all characters numeric; {res}replaced {txt}as {res}long
{txt}F: all characters numeric; {res}replaced {txt}as {res}int
{txt}
{com}. 
. foreach v in AB CE F {c -(}
{txt}  2{com}.         rename `v' diff_robot_stock_`v'
{txt}  3{com}. {c )-}
{res}{txt}
{com}. 
. // 5) Add id variable for merge
. gen id = _n
{txt}
{com}. 
. save "clean_data/foreign_diff_robot_stock", replace
{txt}{p 0 4 2}
file {bf}
clean_data/foreign_diff_robot_stock.dta{rm}
saved
{p_end}

{com}. cd "/Users/aml/AutoEmp/do_files"
{res}/Users/aml/AutoEmp/do_files
{txt}
{com}. 
. log close
      {txt}name:  {res}<unnamed>
       {txt}log:  {res}/Users/aml/AutoEmp/logs/ifr_prep.txt
  {txt}log type:  {res}smcl
 {txt}closed on:  {res}18 Jul 2024, 23:15:14
{txt}{.-}
{smcl}
{txt}{sf}{ul off}