{smcl}
{com}{sf}{ul off}{txt}{.-}
      name:  {res}<unnamed>
       {txt}log:  {res}/Users/aml/AutoEmp/logs/ifr_prep.txt
  {txt}log type:  {res}smcl
 {txt}opened on:  {res} 2 Aug 2024, 17:38:52
{txt}
{com}. 
. import excel "raw_data/ifr/IFR_data_new.xlsx", sheet("Sheet1") firstrow
{res}{text}(7 vars, 1,296 obs)

{com}. save "raw_data/ifr/IFR_data_new.dta", replace
{txt}{p 0 4 2}
file {bf}
raw_data/ifr/IFR_data_new.dta{rm}
saved
{p_end}

{com}. 
. ***
. *** 1) Long differences in robot stock for instrument countries
. ***
. 
. tempfile robots_inst_countries
{txt}
{com}. 
. // Remove unnecessary observations
. keep if Year == 2000 | Year == 2016
{txt}(1,188 observations deleted)

{com}. drop if industrycode == "P"
{txt}(18 observations deleted)

{com}. drop if country == "France"
{txt}(10 observations deleted)

{com}. 
. // Aggregagte on country level
. sort industrycode Year
{txt}
{com}. by industrycode Year: egen robot_stock = total(op_stock) 
{txt}
{com}. drop delivered op_stock country countrycode
{txt}
{com}. duplicates drop Year industrycode, force

{p 0 4}{txt}Duplicates in terms of {res} Year industrycode{p_end}

{txt}(70 observations deleted)

{com}. 
. // Aggregate on industry level
. replace industrycode = "CE" if ///
>         industrycode == "C" | industrycode == "E"
{txt}(4 real changes made)

{com}. collapse (sum) robot_stock, by(Year industrycode)
{res}{txt}
{com}. 
. // Compute long differences and transpose
. by industrycode (Year), sort: ///
>         gen diff_robot_stock = robot_stock - robot_stock[_n-1]
{txt}(4 missing values generated)

{com}. 
. drop if Year == 2000
{txt}(4 observations deleted)

{com}. drop Year robot_stock
{txt}
{com}. sxpose, clear force firstnames destring
{txt}AB: all characters numeric; {res}replaced {txt}as {res}int
{txt}CE: all characters numeric; {res}replaced {txt}as {res}int
{txt}D: all characters numeric; {res}replaced {txt}as {res}long
{txt}F: all characters numeric; {res}replaced {txt}as {res}int
{txt}
{com}. 
. // Rename
. rename AB diff_robots_agri_forest_fish
{res}{txt}
{com}. rename CE diff_robots_other_industry
{res}{txt}
{com}. rename D diff_robots_manufact
{res}{txt}
{com}. rename F diff_robots_construct
{res}{txt}
{com}. 
. // Add id variable for merge
. gen id = _n
{txt}
{com}. 
. save `robots_inst_countries'
{txt}{p 0 4 2}
file {bf}
/var/folders/gj/lpt24fdn4bz32zqcdsrmyzz80000gn/T//S_94849.000001{rm}
saved
as .dta format
{p_end}

{com}. clear
{txt}
{com}. 
. ***
. *** 2) Long differences in robot stock for instrument countries
. ***
. 
. use "raw_data/ifr/IFR_data_new.dta"
{txt}
{com}. 
. // Remove unnecessary observations
. keep if Year == 2000 | Year == 2016
{txt}(1,188 observations deleted)

{com}. drop if industrycode == "P"
{txt}(18 observations deleted)

{com}. keep if country == "France"
{txt}(80 observations deleted)

{com}. 
. // Aggregagte on country level
. sort industrycode Year
{txt}
{com}. by industrycode Year: egen robot_stock = total(op_stock) 
{txt}
{com}. drop delivered op_stock country countrycode
{txt}
{com}. duplicates drop Year industrycode, force

{p 0 4}{txt}Duplicates in terms of {res} Year industrycode{p_end}

{txt}(0 observations are duplicates)

{com}. 
. // Aggregate on industry level
. replace industrycode = "CE" if ///
>         industrycode == "C" | industrycode == "E"
{txt}(4 real changes made)

{com}. collapse (sum) robot_stock, by(Year industrycode)
{res}{txt}
{com}. 
. // Compute long differences and transpose
. by industrycode (Year), sort: ///
>         gen diff_robot_stock = robot_stock - robot_stock[_n-1]
{txt}(4 missing values generated)

{com}. 
. drop if Year == 2000
{txt}(4 observations deleted)

{com}. drop Year robot_stock
{txt}
{com}. sxpose, clear force firstnames destring
{txt}AB: all characters numeric; {res}replaced {txt}as {res}byte
{txt}CE: all characters numeric; {res}replaced {txt}as {res}byte
{txt}D: all characters numeric; {res}replaced {txt}as {res}int
{txt}F: all characters numeric; {res}replaced {txt}as {res}int
{txt}
{com}. 
. // Rename
. rename AB fr_diff_robots_agri_forest_fish
{res}{txt}
{com}. rename CE fr_diff_robots_other_industry
{res}{txt}
{com}. rename D fr_diff_robots_manufact
{res}{txt}
{com}. rename F fr_diff_robots_construct
{res}{txt}
{com}. 
. // Add id variable for merge
. gen id = _n
{txt}
{com}. 
. ***
. *** 3) Merge into one data set
. ***
. 
. merge 1:1 id using `robots_inst_countries'
{res}
{txt}{col 5}Result{col 33}Number of obs
{col 5}{hline 41}
{col 5}Not matched{col 30}{res}               0
{txt}{col 5}Matched{col 30}{res}               1{txt}  (_merge==3)
{col 5}{hline 41}

{com}. drop _merge
{txt}
{com}. 
. save "clean_data/diff_robots", replace
{txt}{p 0 4 2}
file {bf}
clean_data/diff_robots.dta{rm}
saved
{p_end}

{com}. cd "/Users/aml/AutoEmp/do_files"
{res}/Users/aml/AutoEmp/do_files
{txt}
{com}. 
. log close
      {txt}name:  {res}<unnamed>
       {txt}log:  {res}/Users/aml/AutoEmp/logs/ifr_prep.txt
  {txt}log type:  {res}smcl
 {txt}closed on:  {res} 2 Aug 2024, 17:38:53
{txt}{.-}
{smcl}
{txt}{sf}{ul off}