{smcl}
{com}{sf}{ul off}{txt}{.-}
      name:  {res}<unnamed>
       {txt}log:  {res}/Users/aml/AutoEmp/logs/merge.txt
  {txt}log type:  {res}smcl
 {txt}opened on:  {res} 1 Aug 2024, 12:17:57
{txt}
{com}. 
. use "clean_data/emp_regions.dta"
{txt}
{com}. 
. // Merge
. merge m:1 id using "clean_data/emp_countries.dta", update
{res}
{txt}{col 5}Result{col 33}Number of obs
{col 5}{hline 41}
{col 5}Not matched{col 30}{res}               0

{txt}{col 5}Matched{col 30}{res}             100
{txt}{col 9}not updated{col 30}{res}               0{txt}  (_merge==3)
{col 9}missing updated{col 30}{res}             100{txt}  (_merge==4)
{col 9}nonmissing conflict{col 30}{res}               0{txt}  (_merge==5)
{col 5}{hline 41}

{com}. drop _merge
{txt}
{com}. 
. merge m:1 id using "clean_data/diff_robots.dta", update
{res}{txt}{p 0 7 2}
(variable
{bf:diff_robots_manufact} was {bf:float}, now {bf:double} to accommodate using data's values)
{p_end}

{col 5}Result{col 33}Number of obs
{col 5}{hline 41}
{col 5}Not matched{col 30}{res}               0

{txt}{col 5}Matched{col 30}{res}             100
{txt}{col 9}not updated{col 30}{res}               0{txt}  (_merge==3)
{col 9}missing updated{col 30}{res}             100{txt}  (_merge==4)
{col 9}nonmissing conflict{col 30}{res}               0{txt}  (_merge==5)
{col 5}{hline 41}

{com}. drop _merge id
{txt}
{com}. 
. merge m:1 region_code using "clean_data/demographics.dta"
{res}
{txt}{col 5}Result{col 33}Number of obs
{col 5}{hline 41}
{col 5}Not matched{col 30}{res}               4
{txt}{col 9}from master{col 30}{res}               4{txt}  (_merge==1)
{col 9}from using{col 30}{res}               0{txt}  (_merge==2)

{col 5}Matched{col 30}{res}              96{txt}  (_merge==3)
{col 5}{hline 41}

{com}. drop if _merge == 1 | _merge == 2
{txt}(4 observations deleted)

{com}. drop _merge
{txt}
{com}. 
. // Compute long difference in robot exposure
. gen robot_exposure = 0
{txt}
{com}. 
. foreach industry in agri_forest_fish manufact construct other_industry {c -(}
{txt}  2{com}.         gen robot_exposure_`industry' = emp_share_`industry' * ///
>                 (diff_robots_`industry' / emp_base_`industry')
{txt}  3{com}.         replace robot_exposure = robot_exposure + robot_exposure_`industry'
{txt}  4{com}. {c )-}
{txt}(96 real changes made)
(96 real changes made)
(96 real changes made)
(96 real changes made)

{com}. 
. // Compute long difference in employment to population
. gen diff_emp_to_pop = total_emp_2016/population_2016 - total_emp_2000/population_2000
{txt}
{com}. keep region_code region diff_emp_to_pop robot_exposure ///
>         robot_exposure_agri_forest_fish robot_exposure_manufact ///
>         robot_exposure_construct robot_exposure_other_industry female_share ///
>         working_age_pop population_2000 high_school_share bachelor_share FR*
{txt}
{com}. 
. save "clean_data/reg_ready.dta", replace
{txt}{p 0 4 2}
file {bf}
clean_data/reg_ready.dta{rm}
saved
{p_end}

{com}. cd "/Users/aml/AutoEmp/do_files"
{res}/Users/aml/AutoEmp/do_files
{txt}
{com}. log close
      {txt}name:  {res}<unnamed>
       {txt}log:  {res}/Users/aml/AutoEmp/logs/merge.txt
  {txt}log type:  {res}smcl
 {txt}closed on:  {res} 1 Aug 2024, 12:17:57
{txt}{.-}
{smcl}
{txt}{sf}{ul off}