{smcl}
{com}{sf}{ul off}{txt}{.-}
      name:  {res}<unnamed>
       {txt}log:  {res}/Users/aml/AutoEmp/logs/nuts_dummies.txt
  {txt}log type:  {res}smcl
 {txt}opened on:  {res} 6 Aug 2024, 00:32:53
{txt}
{com}. 
. use "clean_data/nuts2_demographics.dta"
{txt}
{com}. 
. // Dummies for every NUTS 1 area (12)
. 
. gen FRC = region_code == "FRC1" | region_code == "FRC2" |  region_code == "FRB0"
{txt}
{com}. 
. gen FRD = region_code == "FRD1" | region_code == "FRD2"
{txt}
{com}. 
. gen FRE = region_code == "FRE1" | region_code == "FRE2" | region_code == "FR10"
{txt}
{com}. 
. gen FRF = region_code == "FRF1" | region_code == "FRF2" | region_code == "FRF3"
{txt}
{com}. 
. gen FRH = region_code == "FRH0" | region_code == "FRG0"
{txt}
{com}. 
. gen FRI = region_code == "FRI1" | region_code == "FRI2" | region_code == "FRI3"
{txt}
{com}. 
. gen FRJ = region_code == "FRJ1" | region_code == "FRJ2"
{txt}
{com}. 
. gen FRK = region_code == "FRK1" | region_code == "FRK2" | region_code == "FRL0"
{txt}
{com}. 
. gen FRM = region_code == "FRM0"
{txt}
{com}. 
. // Check that each region is assigned to exactly one NUTS 2 area
. egen sum_dummies = rowtotal(FRC FRD FRE FRF FRH FRI FRJ FRK FRM)
{txt}
{com}. assert sum_dummies == 1
{txt}
{com}. 
. save "clean_data/nuts2_demographics.dta", replace
{txt}{p 0 4 2}
file {bf}
clean_data/nuts2_demographics.dta{rm}
saved
{p_end}

{com}. cd "$mydir/do_files/nuts2_data_prep"
{res}/Users/aml/AutoEmp/do_files/nuts2_data_prep
{txt}
{com}. log close
      {txt}name:  {res}<unnamed>
       {txt}log:  {res}/Users/aml/AutoEmp/logs/nuts_dummies.txt
  {txt}log type:  {res}smcl
 {txt}closed on:  {res} 6 Aug 2024, 00:32:53
{txt}{.-}
{smcl}
{txt}{sf}{ul off}