{smcl}
{com}{sf}{ul off}{txt}{.-}
      name:  {res}<unnamed>
       {txt}log:  {res}/Users/aml/AutoEmp/logs/nuts2_merge.txt
  {txt}log type:  {res}smcl
 {txt}opened on:  {res} 6 Aug 2024, 00:02:03
{txt}
{com}. 
. use "clean_data/nuts2_emp_regions.dta"
{txt}
{com}. 
. // Merge
. merge 1:1 region_code using "clean_data/nuts2_demographics.dta"
{res}
{txt}{col 5}Result{col 33}Number of obs
{col 5}{hline 41}
{col 5}Not matched{col 30}{res}               1
{txt}{col 9}from master{col 30}{res}               0{txt}  (_merge==1)
{col 9}from using{col 30}{res}               1{txt}  (_merge==2)

{col 5}Matched{col 30}{res}              21{txt}  (_merge==3)
{col 5}{hline 41}

{com}. drop _merge
{txt}
{com}. 
. merge 1:1 region_code using "clean_data/nuts2_wages.dta"
{res}
{txt}{col 5}Result{col 33}Number of obs
{col 5}{hline 41}
{col 5}Not matched{col 30}{res}               0
{txt}{col 5}Matched{col 30}{res}              22{txt}  (_merge==3)
{col 5}{hline 41}

{com}. drop _merge
{txt}
{com}. 
. merge m:1 id using "clean_data/nuts2_emp_countries.dta", update
{res}
{txt}{col 5}Result{col 33}Number of obs
{col 5}{hline 41}
{col 5}Not matched{col 30}{res}               1
{txt}{col 9}from master{col 30}{res}               1{txt}  (_merge==1)
{col 9}from using{col 30}{res}               0{txt}  (_merge==2)

{col 5}Matched{col 30}{res}              21
{txt}{col 9}not updated{col 30}{res}               0{txt}  (_merge==3)
{col 9}missing updated{col 30}{res}              21{txt}  (_merge==4)
{col 9}nonmissing conflict{col 30}{res}               0{txt}  (_merge==5)
{col 5}{hline 41}

{com}. drop _merge
{txt}
{com}. 
. merge m:1 id using "clean_data/nuts2_diff_robots.dta", update
{res}{txt}{p 0 7 2}
(variable
{bf:diff_robots_ind29_30} was {bf:float}, now {bf:double} to accommodate using data's values)
{p_end}

{col 5}Result{col 33}Number of obs
{col 5}{hline 41}
{col 5}Not matched{col 30}{res}               1
{txt}{col 9}from master{col 30}{res}               1{txt}  (_merge==1)
{col 9}from using{col 30}{res}               0{txt}  (_merge==2)

{col 5}Matched{col 30}{res}              21
{txt}{col 9}not updated{col 30}{res}               0{txt}  (_merge==3)
{col 9}missing updated{col 30}{res}              21{txt}  (_merge==4)
{col 9}nonmissing conflict{col 30}{res}               0{txt}  (_merge==5)
{col 5}{hline 41}

{com}. drop _merge
{txt}
{com}. 
. merge m:1 id using "clean_data/nuts2_diff_imports.dta", update
{res}
{txt}{col 5}Result{col 33}Number of obs
{col 5}{hline 41}
{col 5}Not matched{col 30}{res}               1
{txt}{col 9}from master{col 30}{res}               1{txt}  (_merge==1)
{col 9}from using{col 30}{res}               0{txt}  (_merge==2)

{col 5}Matched{col 30}{res}              21
{txt}{col 9}not updated{col 30}{res}              21{txt}  (_merge==3)
{col 9}missing updated{col 30}{res}               0{txt}  (_merge==4)
{col 9}nonmissing conflict{col 30}{res}               0{txt}  (_merge==5)
{col 5}{hline 41}

{com}. drop _merge id
{txt}
{com}. 
. // Compute long differences
. gen robot_exposure = 0
{txt}
{com}. gen frobot_exposure_01 = 0 // 2001-2016 diff
{txt}
{com}. gen frobot_exposure_04 = 0 // 2004-2016 diff
{txt}
{com}. gen usrobot_exposure = 0
{txt}
{com}. gen import_exposure = 0
{txt}
{com}. 
. local varlist ind10_12 ind13_15 ind16 ind17_18 ind19_22 ind23 ind24_25 ind26_27 ///
>         ind28 ind29_30 ind91 AB C E F
{txt}
{com}. 
. foreach industry of local varlist {c -(}
{txt}  2{com}.         
.         // 1) Robot exposure for EU instrument countries (2001-2016)
.         gen robot_exposure_`industry' = emp_share_`industry' * ///
>                 (diff_robots_`industry' / emp_base_`industry')
{txt}  3{com}.         replace robot_exposure = robot_exposure + robot_exposure_`industry'
{txt}  4{com}.         
.         // 2) Robot exposure for US as instrument (2004-2016)
.         gen usrobot_exposure_`industry' = emp_share_`industry' * ///
>                 (us_diff_robots_`industry' / us_emp_base_`industry')
{txt}  5{com}.         replace usrobot_exposure = usrobot_exposure + usrobot_exposure_`industry'
{txt}  6{com}.         
.         // 3) Robot exposure for France (2001-2016)
.         gen frobot_exposure_01_`industry' = emp_share_`industry' * ///
>                 (fr_diff_robots_01_`industry' / fr_emp_base_`industry')
{txt}  7{com}.         replace frobot_exposure_01 = frobot_exposure_01 + frobot_exposure_01_`industry'
{txt}  8{com}.         
.         // 4) Robot exposure for France (2004-2016)
.         gen frobot_exposure_04_`industry' = emp_share_`industry' * ///
>                 (fr_diff_robots_04_`industry' / fr_emp_base_`industry')
{txt}  9{com}.         replace frobot_exposure_04 = frobot_exposure_04 + frobot_exposure_04_`industry'
{txt} 10{com}.         
.         // 5) Import exposure (2012-2016)
.         gen import_exposure_`industry' = emp_share_`industry' * ///
>                 (diff_imp_`industry' / fr_emp_base_`industry')
{txt} 11{com}.         replace import_exposure = import_exposure + import_exposure_`industry'
{txt} 12{com}. {c )-}
{txt}(1 missing value generated)
(22 real changes made, 1 to missing)
(1 missing value generated)
(22 real changes made, 1 to missing)
(1 missing value generated)
(22 real changes made, 1 to missing)
(1 missing value generated)
(22 real changes made, 1 to missing)
(1 missing value generated)
(22 real changes made, 1 to missing)
(1 missing value generated)
(20 real changes made)
(1 missing value generated)
(20 real changes made)
(1 missing value generated)
(20 real changes made)
(1 missing value generated)
(20 real changes made)
(1 missing value generated)
(20 real changes made)
(1 missing value generated)
(21 real changes made)
(1 missing value generated)
(21 real changes made)
(1 missing value generated)
(21 real changes made)
(1 missing value generated)
(21 real changes made)
(1 missing value generated)
(21 real changes made)
(1 missing value generated)
(21 real changes made)
(1 missing value generated)
(21 real changes made)
(1 missing value generated)
(21 real changes made)
(1 missing value generated)
(21 real changes made)
(1 missing value generated)
(21 real changes made)
(1 missing value generated)
(21 real changes made)
(1 missing value generated)
(21 real changes made)
(1 missing value generated)
(21 real changes made)
(1 missing value generated)
(21 real changes made)
(1 missing value generated)
(21 real changes made)
(1 missing value generated)
(21 real changes made)
(1 missing value generated)
(21 real changes made)
(1 missing value generated)
(21 real changes made)
(1 missing value generated)
(21 real changes made)
(1 missing value generated)
(21 real changes made)
(1 missing value generated)
(21 real changes made)
(1 missing value generated)
(21 real changes made)
(1 missing value generated)
(21 real changes made)
(1 missing value generated)
(21 real changes made)
(1 missing value generated)
(21 real changes made)
(1 missing value generated)
(21 real changes made)
(1 missing value generated)
(21 real changes made)
(1 missing value generated)
(21 real changes made)
(1 missing value generated)
(21 real changes made)
(1 missing value generated)
(21 real changes made)
(1 missing value generated)
(21 real changes made)
(1 missing value generated)
(21 real changes made)
(1 missing value generated)
(21 real changes made)
(1 missing value generated)
(21 real changes made)
(1 missing value generated)
(21 real changes made)
(1 missing value generated)
(21 real changes made)
(1 missing value generated)
(21 real changes made)
(1 missing value generated)
(21 real changes made)
(1 missing value generated)
(21 real changes made)
(1 missing value generated)
(21 real changes made)
(1 missing value generated)
(21 real changes made)
(1 missing value generated)
(21 real changes made)
(1 missing value generated)
(21 real changes made)
(1 missing value generated)
(21 real changes made)
(1 missing value generated)
(21 real changes made)
(1 missing value generated)
(21 real changes made)
(1 missing value generated)
(21 real changes made)
(1 missing value generated)
(21 real changes made)
(1 missing value generated)
(21 real changes made)
(1 missing value generated)
(21 real changes made)
(1 missing value generated)
(20 real changes made)
(1 missing value generated)
(20 real changes made)
(1 missing value generated)
(20 real changes made)
(1 missing value generated)
(20 real changes made)
(1 missing value generated)
(20 real changes made)
(1 missing value generated)
(21 real changes made)
(1 missing value generated)
(21 real changes made)
(1 missing value generated)
(21 real changes made)
(1 missing value generated)
(21 real changes made)
(1 missing value generated)
(0 real changes made)
(1 missing value generated)
(21 real changes made)
(1 missing value generated)
(21 real changes made)
(1 missing value generated)
(21 real changes made)
(1 missing value generated)
(21 real changes made)
(1 missing value generated)
(21 real changes made)

{com}. 
. // Compute long difference in employment to population
. gen diff_emp_to_pop_01 = total_emp_2016/population_2016 - ///
>         total_emp_2001/population_2001
{txt}(1 missing value generated)

{com}.         
. gen diff_emp_to_pop_04 = total_emp_2016/population_2016 - ///
>         total_emp_2004/population_2004
{txt}(1 missing value generated)

{com}.         
. gen diff_wages_to_emp_01 = wages_2016/total_emp_2016 - ///
>         wages_2001/total_emp_2001
{txt}(1 missing value generated)

{com}.         
. gen diff_wages_to_emp_04 = wages_2016/total_emp_2016 - ///
>         wages_2004/total_emp_2004
{txt}(1 missing value generated)

{com}.         
. gen diff_log_wages_01 = log_wages_2016 - log_wages_2001
{txt}
{com}. gen diff_log_wages_04 = log_wages_2016 - log_wages_2004
{txt}
{com}.         
. keep region_code region diff_* robot_exposure robot_exposure_* ///
>         frobot_exposure_* usrobot_exposure usrobot_exposure_* import_exposure ///
>         import_exposure_* population_2001 working_age_pop female_share ///
>         high_school_share bachelor_share emp_share_D emp_share_F FR*
{txt}
{com}.         
. order region_code region diff_* robot_exposure robot_exposure_* ///
>         frobot_exposure_* usrobot_exposure usrobot_exposure_* import_exposure ///
>         import_exposure_* population_2001 working_age_pop female_share ///
>         high_school_share bachelor_share emp_share_D emp_share_F FR*
{txt}
{com}. 
. save "clean_data/nuts2_reg_ready.dta", replace
{txt}{p 0 4 2}
file {bf}
clean_data/nuts2_reg_ready.dta{rm}
saved
{p_end}

{com}. cd "/Users/aml/AutoEmp/do_files/nuts2_data_prep"
{res}/Users/aml/AutoEmp/do_files/nuts2_data_prep
{txt}
{com}. log close
      {txt}name:  {res}<unnamed>
       {txt}log:  {res}/Users/aml/AutoEmp/logs/nuts2_merge.txt
  {txt}log type:  {res}smcl
 {txt}closed on:  {res} 6 Aug 2024, 00:02:03
{txt}{.-}
{smcl}
{txt}{sf}{ul off}